/*
 * Вариант 36
 * Из входного потока вводится непрямоугольная матрица целых чисел
 * [Aij]  i = 1, ..., M,  j = 1, ..., Ni.
 * Значения M и Ni заранее не известны и вводятся из входного потока.
 * Сформировать вектор, упорядочив по возрастанию значения той строки матрицы, в которой
 * сумма элементов максимальна. Если таких строк несколько, упорядочить одну (любую) строку.
 * В дополнительных функциях доступ к элементам массивов реализовать с помощью указателей.
 * Исходную и полученную матрицы вывести в выходной поток с необходимыми комментариями.
 * */
#include <lab11.h>

int main() {

    int result = Execute();

    printf("stop");
    return 0;
}

